#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.module.eks.data.aws_partition.current: Reading...
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.resources.data.aws_db_instance.zeno-db: Reading...
module.resources.module.eks.data.aws_caller_identity.current: Reading...
module.resources.data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.data.aws_availability_zones.available: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.resources.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/zeno-production-cluster/cluster]
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.resources.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f6151e1ec7ed4b96]
module.resources.module.eks.aws_iam_role.this[0]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role.this[0]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001]
module.resources.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003]
module.resources.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.data.aws_iam_session_context.current: Reading...
module.resources.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::084375562450:user/tarashish@developmentseed.org]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.resources.data.aws_db_instance.zeno-db: Read complete after 1s [id=zeno-db]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151459683600000005]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151459658300000004]
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2695086987]
module.resources.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=8cd9f3d5-f6e1-49ff-a032-da1528c9daa4]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151459701100000006]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500034600000008]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150083720000000d]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150038690000000b]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150080180000000c]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500094000000009]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150036100000000a]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500015800000007]
module.resources.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/zeno-production-cluster]
module.resources.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013]
module.resources.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01d72c016ec1365bf]
module.resources.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02f79d9422c79d174]
module.resources.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0721a42d5f02f490a]
module.resources.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dca056b5cb3f4bdc]
module.resources.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bd86b2d1d4c494db]
module.resources.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0aad369235ab19564]
module.resources.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b2d1b545f702eceb]
module.resources.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-060bb06a5c8393f81]
module.resources.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-01e99d583cc16bbd6]
module.resources.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f703710ef8983d5a]
module.resources.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e9ba580b832e58ab]
module.resources.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00564600fc0109d5f]
module.resources.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c9a24adf6985b148]
module.resources.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e06cd84685011ff8]
module.resources.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151528958300000014]
module.resources.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04e1927500c13e36f]
module.resources.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f703710ef8983d5a1080289494]
module.resources.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f01ab3ef8fb36172]
module.resources.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0527a821acc8b2d5d]
module.resources.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05a8a28a38e5d35a9]
module.resources.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3638724160]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-887369126]
module.resources.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3648003083]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2598257535]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-4255533616]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1125720652]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-666374535]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3210305847]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1048699024]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2982503749]
module.resources.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-334661475]
module.resources.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-006325e67577ba7cb]
module.resources.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03cbd09508fae031c]
module.resources.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0dbcf7c72bb07f949]
module.resources.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fe07f0eb9fb2161d]
module.resources.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e06cd84685011ff81080289494]
module.resources.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=zeno-production-cluster]
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.resources.module.eks.data.tls_certificate.this[0]: Reading...
module.resources.module.eks.time_sleep.this[0]: Refreshing state... [id=2024-11-24T15:26:39Z]
module.resources.module.eks.module.eks_managed_node_group["regular"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=6616271754968722364]
module.resources.module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8124355570844009309]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_launch_template.this[0]: Refreshing state... [id=lt-099de2edeeea863c8]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0fdd12ec7c2965609]
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.resources.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.resources.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-production-cluster:regular-2024112415264607270000001b]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-production-cluster:default-20241124152646072500000019]
module.resources.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=zeno-production-cluster:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.resources.aws_db_instance.eoapi will be created
  + resource "aws_db_instance" "eoapi" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "eoapi"
      + db_subnet_group_name                  = "eoapi-production"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "17.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "eoapi-production"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "eoapi-postgres17-production"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "production"
          + "Name"        = "eoapi-production"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "Name"        = "eoapi-production"
        }
      + timezone                              = (known after apply)
      + username                              = "eoapi"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.resources.aws_db_parameter_group.eoapi_postgres17 will be created
  + resource "aws_db_parameter_group" "eoapi_postgres17" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "postgres17"
      + id           = (known after apply)
      + name         = "eoapi-postgres17-production"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags_all     = (known after apply)
    }

  # module.resources.aws_db_subnet_group.eoapi will be created
  + resource "aws_db_subnet_group" "eoapi" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "eoapi-production"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-00564600fc0109d5f",
          + "subnet-0c9a24adf6985b148",
          + "subnet-0e9ba580b832e58ab",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "production"
          + "Name"        = "eoapi-production"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "Name"        = "eoapi-production"
        }
      + vpc_id                  = (known after apply)
    }

  # module.resources.aws_security_group.eoapi_db will be created
  + resource "aws_security_group" "eoapi_db" {
      + arn                    = (known after apply)
      + description            = "Security group for eoapi database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01e99d583cc16bbd6",
                  + "sg-0bd86b2d1d4c494db",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "eoapi-db-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "Name"        = "eoapi-db-production"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "eoapi-db-production"
        }
      + vpc_id                 = "vpc-0f6151e1ec7ed4b96"
    }

  # module.resources.kubernetes_secret.eoapi_db_credentials will be created
  + resource "kubernetes_secret" "eoapi_db_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "eoapi-db-credentials"
          + namespace        = "eoapi"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "zeno-production-cluster:regular-2024112415264607270000001b"
        tags                   = {
            "Name" = "regular"
        }
        # (16 unchanged attributes hidden)

      ~ scaling_config {
          ~ max_size     = 2 -> 3
          ~ min_size     = 1 -> 2
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @batpad, Action: `pull_request`*